app/Controllers/Mahasiswa/EditCourseController.php

    public function index()
    {
        $model = new CoursesModel(); // Initialize the CoursesModel to interact with the courses table

        // Fetch all courses from the database using the model's findAll method
        $data['courses'] = $model->findAll();
---
SELECT *
FROM `courses`

    public function create()
    {
        $model = new CoursesModel(); // Initialize the CoursesModel

        // Get the number of credits from the form submission
        $credits = $this->request->getPost('credits');

        // Calculate the course duration based on credits (1 credit = 50 minutes)
        $duration = $credits * 50;

        // Prepare the data array to be saved in the database
        $data = [
            'course_name' => $this->request->getPost('course_name'), // Get the course name
            'credits' => $credits, // Get the number of credits
            'semester' => $this->request->getPost('semester'), // Get the semester
            'day' => $this->request->getPost('day'), // Get the day of the week
            'start_time' => $this->request->getPost('start_time'), // Get the course start time
            'duration' => $duration, // Set the calculated course duration
        ];

        // Save the new course data in the database
        $model->save($data);
---
INSERT INTO `courses` (`course_name`, `credits`, `semester`, `day`, `start_time`, `duration`) VALUES ('tes', '3', '3', 'Senin', '03:03', 150)

    public function delete($id)
    {
        $model = new CoursesModel(); // Initialize the CoursesModel

        // Delete the course from the database based on the provided ID
        $model->delete($id);
---
DELETE FROM `courses`
WHERE `id` IN ('50')