app/Controllers/Mahasiswa/IPController.php

    public function generatorView()
    {
        $coursesModel = new CoursesModel(); // Initialize the CoursesModel to interact with the courses table
        $studentId = session()->get('id'); // Retrieve the student ID from the session

        // Get the list of courses taken by the student by joining 'students_courses' and 'courses' tables
        $courses = $coursesModel->select('courses.id, courses.course_name, courses.credits')
                                ->join('students_courses', 'students_courses.course_id = courses.id')
                                ->where('students_courses.student_id', $studentId)
                                ->findAll(); // Fetch all courses for the student
---
SELECT `courses`.`id`, `courses`.`course_name`, `courses`.`credits`
FROM `courses`
JOIN `students_courses` ON `students_courses`.`course_id` = `courses`.`id`
WHERE `students_courses`.`student_id` = '55'

    public function generateIP()
    {
        // Get grades from the form input (assumes grades are submitted as an associative array)
        $grades = $this->request->getPost('grades');
        $totalCredits = 0; // Initialize the total credits counter
        $totalWeightedGrade = 0; // Initialize the weighted grade counter

        // Loop through each course and grade
        foreach ($grades as $courseId => $grade) {
            $course = (new CoursesModel())->find($courseId); // Fetch the course details by its ID
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = 39