app/Controllers/Mahasiswa/PendaftaranController.php

    public function index()
    {
        $coursesModel = new CoursesModel(); // Initialize the CoursesModel to interact with the courses table
        $courses = $coursesModel->findAll(); // Fetch all available courses
---
SELECT *
FROM `courses`

    public function pilih()
    {
        $studentsCoursesModel = new StudentsCoursesModel(); // Initialize the StudentsCoursesModel to interact with the registration table

        // Get the student ID from the session
        $studentId = session()->get('id');
        if (!$studentId) {
            return redirect()->back()->with('error', 'Anda belum login'); // Redirect back if student is not logged in
        }

        // Get the course ID and semester from the form input
        $courseId = $this->request->getPost('course_id');
        $semester = $this->request->getPost('semester');

        // Validate the input data
        if (!$courseId || !$semester) {
            return redirect()->back()->with('error', 'Data tidak valid'); // Redirect if data is invalid
        }

        // Check if the student has already registered for the course
        $exists = $studentsCoursesModel->where('student_id', $studentId)
            ->where('course_id', $courseId)
            ->first();
---
SELECT *
FROM `students_courses`
WHERE `student_id` = '55'
AND `course_id` = '3'
 LIMIT 1

        ];

        // Insert the registration data into the database
        if ($studentsCoursesModel->insert($data)) {
---
INSERT INTO `students_courses` (`student_id`, `course_id`, `semester`) VALUES ('55', '3', '5')

    public function batal()
    {
        $studentsCoursesModel = new StudentsCoursesModel(); // Initialize the StudentsCoursesModel

        // Get the student ID from the session
        $studentId = session()->get('id');
        if (!$studentId) {
            return redirect()->back()->with('error', 'Anda belum login'); // Redirect if student is not logged in
        }

        // Get the course ID from the form input
        $courseId = $this->request->getPost('course_id');

        // Validate the input data
        if (!$courseId) {
            return redirect()->back()->with('error', 'Data tidak valid'); // Redirect if course ID is not valid
        }

        // Delete the course registration for the student
        $studentsCoursesModel->where('student_id', $studentId)
            ->where('course_id', $courseId)
            ->delete();
---
DELETE FROM `students_courses`
WHERE `student_id` = '55'
AND `course_id` = '3'